{
    "newjoin_Question1": "HR continues to provide support in addressing my queries / needs from time to time",
    "newjoin_Question2": "HR Representatives are always available to provide clarifications on policies and procedures",
    "newjoin_Question3": "HR has helped me have a smooth and seamless transition into TVSNext",
    "newjoin_Question4": "Do you have any suggestions to improve the HR interface with new joinees?",
    "newjoin_Question5": "My roles and responsibilities have been made very clear to me",
    "newjoin_Question6": "New joinees are inducted properly inducted into the team",
    "newjoin_Question7": "My job is more or less what I envisioned it to be prior to joining",
    "newjoin_Question8": "My skills are being utilized fully and appropriately",
    "newjoin_Question9": "Do you have any suggestions to improve orientation to new joinees at the unit level?",
    "newjoin_Question10": "I can still approach my buddy for any support",
    "newjoin_Question11": "I was able to understand the organization and department better through my buddy",
    "newjoin_Question12": "The Buddy Program is a well thought out process and should be continued for the benefit of all new joinees",
    "newjoin_Question13": "Do you have any suggestions to improve the current buddy program?",
    "newjoin_Question14": "TVSNext practices the open culture policy that it professes to have",
    "newjoin_Question15": "The work environment is very professional and friendly",
    "newjoin_Question16": "The Senior Management is very approachable",
    "newjoin_Question17": "The communication channels are wide and open. There are sufficient forums to voice one’s opinion",
    "newjoin_Question18": "The organization has met my expectations in terms of utilizing my capabilities (contribution to organizational initiatives)",
    "newjoin_Question19": "Do you have any suggestions to positively impact the culture and environment at TVSNext?",
    "newjoin_Question20": "Any other feedback / suggestions?",
    "newjoin_Question21": "Can you suggest any existing practice of our company looks odd? If yes, then what is your opinion what improvement can be brought in?",
    "newjoin_Question22": "What are some elements of the position you are not enjoying as much? Is this because you have not been given the proper tools or training to be successful, or because you simply do not prefer this kind of work in general?",
    "newjoin_Question23": "So far, is the job what you expected it to be? Are you feeling challenged by the position, or are you already feeling bored (are you being pushed out of your comfort zone so that you are learning new things or are you stagnating?)"
}